#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.main_module.aws_organizations_account.account_without_org_unit["0"] will be created
  + resource "aws_organizations_account" "account_without_org_unit" {
      + arn                        = (known after apply)
      + close_on_deletion          = false
      + create_govcloud            = false
      + email                      = "email1@domain1.com"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "prefix1-account1"
      + parent_id                  = (known after apply)
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

  # module.main_module.aws_organizations_account.account_without_org_unit["1"] will be created
  + resource "aws_organizations_account" "account_without_org_unit" {
      + arn                        = (known after apply)
      + close_on_deletion          = false
      + create_govcloud            = false
      + email                      = "email2@domain2.com"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "prefix2-account2"
      + parent_id                  = (known after apply)
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Excoriate, Action: `pull_request`*